In [31]:
import pandas as pd 
from difflib import SequenceMatcher as SM
df_club=pd.read_csv("Clubs_data.csv")
df_meta=pd.read_csv("Metadata.csv")
df_organiser=pd.read_csv("Organisers_In_Fests.csv")
df_participants=pd.read_csv("Participants_In_Fests.csv")

In [2]:
def is_similarity(first, second, ratio):
    return SM(None, first, second).ratio() > ratio

In [32]:
#For Club name correction
for Index, row in df_club.iterrows():
    # print(Index, len(df_club.iloc[Index]["Name"]))
    df_club.at[Index, "Name"] = row["Name"].lower()
    for Index2, row2 in df_meta.iterrows():
        df_meta.at[Index2, "Name"] = row2["Name"].lower()
        if is_similarity(row["Name"], row2["Name"], 0.64):
            df_club.at[Index, "Name"] = row2["Name"]

In [33]:
list_small_5 = []
for Index, row in df_club.iterrows():
    if len(df_club.iloc[Index]["Name"]) < 7:
        list_small_5.append(Index)

In [34]:
df_club = df_club.drop(df_club.index[list_small_5])

In [35]:
#For Participants Name correction
for Index, row in df_participants.iterrows():
    df_participants.at[Index, "Name"] = row["Name"].lower()
    for Index2, row2 in df_meta.iterrows():
        df_meta.at[Index2, "Name"] = row2["Name"].lower()
        if is_similarity(row["Name"], row2["Name"], 0.59):
            df_participants.at[Index, "Name"] = row2["Name"]

In [36]:
list_small_7 = []
for Index, row in df_participants.iterrows():
    if len(df_participants.iloc[Index]["Name"]) < 7:
        list_small_7.append(Index)

In [37]:
df_participants = df_participants.drop(df_participants.index[list_small_7])

In [9]:
df_club

     Club_Name             Name           Event         Role
0       club_3   darien martens  club_3_event_2  Participant
1       club_2     sage schrock  club_2_event_1  Participant
2       club_3     alison mcvey  club_3_event_2  Participant
3       club_1   kiara jauregui  club_1_event_1  Participant
4       club_2        tate blum  club_2_event_3  Participant
...        ...              ...             ...          ...
1041    club_3      kalen logan  club_3_event_2  organiser_3
1042    club_3   kathrine leone  club_3_event_3  organiser_1
1043    club_1      ibrehimusku  club_1_event_2  Participant
1044    club_1  milo greenfield  club_1_event_2  Participant
1045    club_1      daisha yoon  club_1_event_2  Participant

[987 rows x 4 columns]

In [75]:
df_organiser = pd.read_csv("Organisers_In_Fests.csv")
df_organiser.head(20)

   Fest_Name                Name          Role
0     fest_2       Stcerr Hbmond   organiser_2
1     fest_2         Ayliwn Slks   organiser_6
2     fest_2  Sebestien Hickjman   organiser_7
3     fest_2     Grechen Chlewsn   organiser_8
4     fest_1            Evelin B   organiser_1
5     fest_2   leniez Gilbertson  organiser_10
6     fest_1    mRiver Flipcieno   organiser_2
7     fest_1            Leona Ca   organiser_9
8     fest_2           Ay Kehnei   organiser_1
9     fest_1       tbdulelh Hors   organiser_6
10    fest_2           S Stephon   organiser_3
11    fest_1       Prxry Pefryen  organiser_10
12    fest_1           Derii Dai   organiser_3
13    fest_1                  RB   organiser_5
14    fest_1          Jordi Taem   organiser_4
15    fest_2                  AM   organiser_4
16    fest_2    Reshawn Balsdeas   organiser_5
17    fest_1    Bline Mckesnezie   organiser_7
18    fest_1      Ashanti John K   organiser_8
19    fest_2      zoie mcdermott   organiser_9

In [76]:
for Index, row in df_organiser.iterrows():
    df_organiser.at[Index, "Name"] = row["Name"].lower()
    for Index2, row2 in df_meta.iterrows():
        df_meta.at[Index2, "Name"] = row2["Name"].lower()
        if is_similarity(row["Name"], row2["Name"], 0.69):
            df_organiser.at[Index, "Name"] = row2["Name"]

In [79]:
df_organiser.head(20)

   Fest_Name                Name          Role
0     fest_2       starr hammond   organiser_2
1     fest_2         aylin seals   organiser_6
2     fest_2   sebastien hickman   organiser_7
3     fest_2    gretchen clawson   organiser_8
4     fest_1      evelin bradley   organiser_1
5     fest_2  delanie gilbertson  organiser_10
6     fest_1     river feliciano   organiser_2
7     fest_1        leona cabral   organiser_9
8     fest_2         aya kennedy   organiser_1
9     fest_1      abdullah reddy   organiser_6
10    fest_2           s stephon   organiser_3
11    fest_1      perry perryman  organiser_10
12    fest_1         daria daily   organiser_3
14    fest_1           jordi tam   organiser_4
16    fest_2    rashawn balderas   organiser_5
17    fest_1     blaine mckenzie   organiser_7
18    fest_1      ashanti koenig   organiser_8
19    fest_2      zoie mcdermott   organiser_9

In [ ]:
list_small_7 = []
for Index, row in df_organiser.iterrows():
    if len(df_organiser.iloc[Index]["Name"]) < 7:
        list_small_7.append(Index)

In [165]:
df_combined = pd.concat([df_club,df_organiser,df_participants], ignore_index=True)

In [166]:
import numpy as np
# df_combined = df_combined.sort_values(by=["Name"])
df_combined['Roll No.'] = np.nan

In [167]:
for Index, row in df_combined.iterrows():
    for Index2, row2 in df_meta.iterrows():
        if row["Name"] == row2["Name"]:
            df_combined.at[Index, "Roll No."] = row2["ID"]

In [168]:
df_combined.head()

  Club_Name            Name           Event         Role Fest_Name    Roll No.
0    club_3  darien martens  club_3_event_2  Participant       NaN  17XJ1A0220
1    club_2    sage schrock  club_2_event_1  Participant       NaN  17XJ1A0165
2    club_3    alison mcvey  club_3_event_2  Participant       NaN  17XJ1A0255
3    club_1  kiara jauregui  club_1_event_1  Participant       NaN  17XJ1A0243
4    club_2       tate blum  club_2_event_3  Participant       NaN  18XJ1A0184

In [169]:
df_combined = df_combined.sort_values(by="Roll No.")

In [170]:
df_combined.head()

,Club_Name,Name,Event,Role,Fest_Name,Roll No.
1704,NaN,monet wallace,fest_2_event_5,NaN,fest_2,17XJ1A0100
1395,NaN,monet wallace,fest_2_event_3,NaN,fest_2,17XJ1A0100
931,club_2,monet wallace,club_2_event_1,Participant,NaN,17XJ1A0100
2855,NaN,monet wallace,fest_1_event_1,NaN,fest_1,17XJ1A0100
4951,NaN,monet wallace,fest_1_event_4,NaN,fest_1,17XJ1A0100

In [175]:
df_combined_No_Null = df_combined[df_combined["Roll No."].notnull()]

In [180]:
df_combined_No_Null = df_combined_No_Null.sort_values(by="Roll No.")

In [164]:
df_combined_No_Null.to_csv('Combine.csv')

In [16]:
# df_combined.columns 
# ID=[]
# for i in range(1,len(df_combined)+1):
#     ID.append(i)
# df_combined["ID"]=ID
# df_combined.tail()

     Club_Name              Name            Event Role Fest_Name    ID
4763       NaN    zoie mcdermott   fest_2_event_9  NaN    fest_2  5459
4764       NaN      jayna rowley   fest_2_event_7  NaN    fest_2  5460
4765       NaN   debra clevenger  fest_2_event_11  NaN    fest_2  5461
4766       NaN     theron stroud   fest_1_event_6  NaN    fest_1  5462
4768       NaN  kendrick valadez   fest_2_event_2  NaN    fest_2  5463

In [19]:
# df_combined["Club_Name"]=df_combined["Club_Name"].fillna("Not There")
# df_combined["Event"]=df_combined["Club_Name"].fillna("Not There")
# df_combined["Role"]=df_combined["Role"].fillna("Not There")
# df_combined["Fest_Name"]=df_combined["Fest_Name"].fillna("Not There") 

# df_combined.head()

  Club_Name            Name   Event         Role  Fest_Name  ID
0    club_3  darien martens  club_3  Participant  Not There   1
1    club_2    sage schrock  club_2  Participant  Not There   2
2    club_3    alison mcvey  club_3  Participant  Not There   3
3    club_1  kiara jauregui  club_1  Participant  Not There   4
4    club_2       tate blum  club_2  Participant  Not There   5

In [21]:
# df_combined["Name"].head() 
# names=df_meta["Name"].tolist()
# roll=df_meta["ID"].tolist() 

# df_combined.set_index("ID", drop=True, inplace=True)
# dictionary_combined = df_combined.to_dict(orient="index")

In [25]:
# print(dictionary_combined[1])

{'Club_Name': 'club_3', 'Name': 'darien martens', 'Event': 'club_3', 'Role': 'Participant', 'Fest_Name': 'Not There'}

In [22]:
# for i in range(dictionary_combined):
#     for j in range(names):
#         if dictionary_combined[i]["Name"]==names[j]:
#             dictionary_combined[i]["Name"]=roll[j]

TypeError: 'dict' object cannot be interpreted as an integer